MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27J53/mcu.h
// Register: RPINR23
#define RPINR23 RPINR23
extern volatile unsigned char           RPINR23             __at(0xEFE);
#ifndef _LIB_BUILD
asm("RPINR23 equ 0EFEh");
#endif

// Register: RPINR24
#define RPINR24 RPINR24
extern volatile unsigned char           RPINR24             __at(0xEFF);
#ifndef _LIB_BUILD
asm("RPINR24 equ 0EFFh");
#endif

// Register: CCP10CON
#define CCP10CON CCP10CON
extern volatile unsigned char           CCP10CON            __at(0xF00);
#ifndef _LIB_BUILD
asm("CCP10CON equ 0F00h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP10M                 :4;
        unsigned DC10B                  :2;
    };
    struct {
        unsigned CCP10M0                :1;
        unsigned CCP10M1                :1;
        unsigned CCP10M2                :1;
        unsigned CCP10M3                :1;
        unsigned DC10B0                 :1;
        unsigned DC10B1                 :1;
    };
} CCP10CONbits_t;
extern volatile CCP10CONbits_t CCP10CONbits __at(0xF00);
// bitfield macros
#define _CCP10CON_CCP10M_POSN                               0x0
#define _CCP10CON_CCP10M_POSITION                           0x0
#define _CCP10CON_CCP10M_SIZE                               0x4
#define _CCP10CON_CCP10M_LENGTH                             0x4
#define _CCP10CON_CCP10M_MASK                               0xF
#define _CCP10CON_DC10B_POSN                                0x4
#define _CCP10CON_DC10B_POSITION                            0x4
#define _CCP10CON_DC10B_SIZE                                0x2
#define _CCP10CON_DC10B_LENGTH                              0x2
#define _CCP10CON_DC10B_MASK                                0x30
#define _CCP10CON_CCP10M0_POSN                              0x0
#define _CCP10CON_CCP10M0_POSITION                          0x0
#define _CCP10CON_CCP10M0_SIZE                              0x1
#define _CCP10CON_CCP10M0_LENGTH                            0x1
#define _CCP10CON_CCP10M0_MASK                              0x1
#define _CCP10CON_CCP10M1_POSN                              0x1
#define _CCP10CON_CCP10M1_POSITION                          0x1
#define _CCP10CON_CCP10M1_SIZE                              0x1
#define _CCP10CON_CCP10M1_LENGTH                            0x1
#define _CCP10CON_CCP10M1_MASK                              0x2
#define _CCP10CON_CCP10M2_POSN                              0x2
#define _CCP10CON_CCP10M2_POSITION                          0x2
#define _CCP10CON_CCP10M2_SIZE                              0x1
#define _CCP10CON_CCP10M2_LENGTH                            0x1
#define _CCP10CON_CCP10M2_MASK                              0x4
#define _CCP10CON_CCP10M3_POSN                              0x3
#define _CCP10CON_CCP10M3_POSITION                          0x3
#define _CCP10CON_CCP10M3_SIZE                              0x1
#define _CCP10CON_CCP10M3_LENGTH                            0x1
#define _CCP10CON_CCP10M3_MASK                              0x8
#define _CCP10CON_DC10B0_POSN                               0x4
#define _CCP10CON_DC10B0_POSITION                           0x4
#define _CCP10CON_DC10B0_SIZE                               0x1
#define _CCP10CON_DC10B0_LENGTH                             0x1
#define _CCP10CON_DC10B0_MASK                               0x10
#define _CCP10CON_DC10B1_POSN                               0x5
#define _CCP10CON_DC10B1_POSITION                           0x5
#define _CCP10CON_DC10B1_SIZE                               0x1
#define _CCP10CON_DC10B1_LENGTH                             0x1
#define _CCP10CON_DC10B1_MASK                               0x20

// Register: CCPR10L
#define CCPR10L CCPR10L
extern volatile unsigned char           CCPR10L             __at(0xF01);
#ifndef _LIB_BUILD
asm("CCPR10L equ 0F01h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR10L                :8;
    };
} CCPR10Lbits_t;
extern volatile CCPR10Lbits_t CCPR10Lbits __at(0xF01);
// bitfield macros
#define _CCPR10L_CCPR10L_POSN                               0x0
#define _CCPR10L_CCPR10L_POSITION                           0x0
#define _CCPR10L_CCPR10L_SIZE                               0x8
#define _CCPR10L_CCPR10L_LENGTH                             0x8
#define _CCPR10L_CCPR10L_MASK                               0xFF

// Register: CCPR10H
#define CCPR10H CCPR10H
extern volatile unsigned char           CCPR10H             __at(0xF02);
#ifndef _LIB_BUILD
asm("CCPR10H equ 0F02h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR10H                :8;
    };
} CCPR10Hbits_t;
extern volatile CCPR10Hbits_t CCPR10Hbits __at(0xF02);
// bitfield macros
#define _CCPR10H_CCPR10H_POSN                               0x0
#define _CCPR10H_CCPR10H_POSITION                           0x0
#define _CCPR10H_CCPR10H_SIZE                               0x8
#define _CCPR10H_CCPR10H_LENGTH                             0x8
#define _CCPR10H_CCPR10H_MASK                               0xFF

// Register: CCP9CON
#define CCP9CON CCP9CON
extern volatile unsigned char           CCP9CON             __at(0xF03);
#ifndef _LIB_BUILD
asm("CCP9CON equ 0F03h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP9M                  :4;
        unsigned DC9B                   :2;
    };
    struct {
        unsigned CCP9M0                 :1;
        unsigned CCP9M1                 :1;
        unsigned CCP9M2                 :1;
        unsigned CCP9M3                 :1;
        unsigned DC9B0                  :1;
        unsigned DC9B1                  :1;
    };
} CCP9CONbits_t;
extern volatile CCP9CONbits_t CCP9CONbits __at(0xF03);
// bitfield macros
#define _CCP9CON_CCP9M_POSN                                 0x0
#define _CCP9CON_CCP9M_POSITION                             0x0
#define _CCP9CON_CCP9M_SIZE                                 0x4
#define _CCP9CON_CCP9M_LENGTH                               0x4
#define _CCP9CON_CCP9M_MASK                                 0xF
#define _CCP9CON_DC9B_POSN                                  0x4
#define _CCP9CON_DC9B_POSITION                              0x4
#define _CCP9CON_DC9B_SIZE                                  0x2
#define _CCP9CON_DC9B_LENGTH                                0x2
#define _CCP9CON_DC9B_MASK                                  0x30
#define _CCP9CON_CCP9M0_POSN                                0x0
#define _CCP9CON_CCP9M0_POSITION                            0x0
#define _CCP9CON_CCP9M0_SIZE                                0x1
#define _CCP9CON_CCP9M0_LENGTH                              0x1
#define _CCP9CON_CCP9M0_MASK                                0x1
#define _CCP9CON_CCP9M1_POSN                                0x1
#define _CCP9CON_CCP9M1_POSITION                            0x1
#define _CCP9CON_CCP9M1_SIZE                                0x1
#define _CCP9CON_CCP9M1_LENGTH                              0x1
#define _CCP9CON_CCP9M1_MASK                                0x2
#define _CCP9CON_CCP9M2_POSN                                0x2
#define _CCP9CON_CCP9M2_POSITION                            0x2
#define _CCP9CON_CCP9M2_SIZE                                0x1
#define _CCP9CON_CCP9M2_LENGTH                              0x1
#define _CCP9CON_CCP9M2_MASK                                0x4
#define _CCP9CON_CCP9M3_POSN                                0x3
#define _CCP9CON_CCP9M3_POSITION                            0x3
#define _CCP9CON_CCP9M3_SIZE                                0x1
#define _CCP9CON_CCP9M3_LENGTH                              0x1
#define _CCP9CON_CCP9M3_MASK                                0x8
#define _CCP9CON_DC9B0_POSN                                 0x4
#define _CCP9CON_DC9B0_POSITION                             0x4
#define _CCP9CON_DC9B0_SIZE                                 0x1
#define _CCP9CON_DC9B0_LENGTH                               0x1
#define _CCP9CON_DC9B0_MASK                                 0x10
#define _CCP9CON_DC9B1_POSN                                 0x5
#define _CCP9CON_DC9B1_POSITION                             0x5
#define _CCP9CON_DC9B1_SIZE                                 0x1
#define _CCP9CON_DC9B1_LENGTH                               0x1
#define _CCP9CON_DC9B1_MASK                                 0x20

// Register: CCPR9L
#define CCPR9L CCPR9L
extern volatile unsigned char           CCPR9L              __at(0xF04);
#ifndef _LIB_BUILD
asm("CCPR9L equ 0F04h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR9L                 :8;
    };
} CCPR9Lbits_t;
extern volatile CCPR9Lbits_t CCPR9Lbits __at(0xF04);
// bitfield macros
#define _CCPR9L_CCPR9L_POSN                                 0x0
#define _CCPR9L_CCPR9L_POSITION                             0x0
#define _CCPR9L_CCPR9L_SIZE                                 0x8
#define _CCPR9L_CCPR9L_LENGTH                               0x8
#define _CCPR9L_CCPR9L_MASK                                 0xFF

// Register: CCPR9H
#define CCPR9H CCPR9H
extern volatile unsigned char           CCPR9H              __at(0xF05);
#ifndef _LIB_BUILD
asm("CCPR9H equ 0F05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR9H                 :8;
    };
} CCPR9Hbits_t;
extern volatile CCPR9Hbits_t CCPR9Hbits __at(0xF05);
// bitfield macros
#define _CCPR9H_CCPR9H_POSN                                 0x0
#define _CCPR9H_CCPR9H_POSITION                             0x0
#define _CCPR9H_CCPR9H_SIZE                                 0x8
#define _CCPR9H_CCPR9H_LENGTH                               0x8
#define _CCPR9H_CCPR9H_MASK                                 0xFF

// Register: CCP8CON
#define CCP8CON CCP8CON
extern volatile unsigned char           CCP8CON             __at(0xF06);
#ifndef _LIB_BUILD
asm("CCP8CON equ 0F06h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP8M                  :4;
        unsigned DC8B                   :2;
    };
    struct {
        unsigned CCP8M0                 :1;
        unsigned CCP8M1                 :1;
        unsigned CCP8M2                 :1;
        unsigned CCP8M3                 :1;
        unsigned DC8B0                  :1;
        unsigned DC8B1                  :1;
    };
} CCP8CONbits_t;
extern volatile CCP8CONbits_t CCP8CONbits __at(0xF06);
// bitfield macros
#define _CCP8CON_CCP8M_POSN                                 0x0
#define _CCP8CON_CCP8M_POSITION                             0x0
#define _CCP8CON_CCP8M_SIZE                                 0x4
#define _CCP8CON_CCP8M_LENGTH                               0x4
#define _CCP8CON_CCP8M_MASK                                 0xF
#define _CCP8CON_DC8B_POSN                                  0x4
#define _CCP8CON_DC8B_POSITION                              0x4
#define _CCP8CON_DC8B_SIZE                                  0x2
#define _CCP8CON_DC8B_LENGTH                                0x2
#define _CCP8CON_DC8B_MASK                                  0x30
#define _CCP8CON_CCP8M0_POSN                                0x0
#define _CCP8CON_CCP8M0_POSITION                            0x0
#define _CCP8CON_CCP8M0_SIZE                                0x1
#define _CCP8CON_CCP8M0_LENGTH                              0x1
#define _CCP8CON_CCP8M0_MASK                                0x1
#define _CCP8CON_CCP8M1_POSN                                0x1
#define _CCP8CON_CCP8M1_POSITION                            0x1
#define _CCP8CON_CCP8M1_SIZE                                0x1
#define _CCP8CON_CCP8M1_LENGTH                              0x1
#define _CCP8CON_CCP8M1_MASK                                0x2
#define _CCP8CON_CCP8M2_POSN                                0x2
#define _CCP8CON_CCP8M2_POSITION                            0x2
#define _CCP8CON_CCP8M2_SIZE                                0x1
#define _CCP8CON_CCP8M2_LENGTH                              0x1
#define _CCP8CON_CCP8M2_MASK                                0x4
#define _CCP8CON_CCP8M3_POSN                                0x3
#define _CCP8CON_CCP8M3_POSITION                            0x3
#define _CCP8CON_CCP8M3_SIZE                                0x1
#define _CCP8CON_CCP8M3_LENGTH                              0x1
#define _CCP8CON_CCP8M3_MASK                                0x8
#define _CCP8CON_DC8B0_POSN                                 0x4
#define _CCP8CON_DC8B0_POSITION                             0x4
#define _CCP8CON_DC8B0_SIZE                                 0x1
#define _CCP8CON_DC8B0_LENGTH                               0x1
#define _CCP8CON_DC8B0_MASK                                 0x10
#define _CCP8CON_DC8B1_POSN                                 0x5
#define _CCP8CON_DC8B1_POSITION                             0x5
#define _CCP8CON_DC8B1_SIZE                                 0x1
#define _CCP8CON_DC8B1_LENGTH                               0x1
#define _CCP8CON_DC8B1_MASK                                 0x20

// Register: CCPR8L
#define CCPR8L CCPR8L
extern volatile unsigned char           CCPR8L              __at(0xF07);
#ifndef _LIB_BUILD
asm("CCPR8L equ 0F07h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR8L                 :8;
    };
} CCPR8Lbits_t;
extern volatile CCPR8Lbits_t CCPR8Lbits __at(0xF07);
// bitfield macros
#define _CCPR8L_CCPR8L_POSN                                 0x0
#define _CCPR8L_CCPR8L_POSITION                             0x0
#define _CCPR8L_CCPR8L_SIZE                                 0x8
#define _CCPR8L_CCPR8L_LENGTH                               0x8
#define _CCPR8L_CCPR8L_MASK                                 0xFF

// Register: CCPR8H
#define CCPR8H CCPR8H
extern volatile unsigned char           CCPR8H              __at(0xF08);
#ifndef _LIB_BUILD
asm("CCPR8H equ 0F08h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR8H                 :8;
    };
} CCPR8Hbits_t;
extern volatile CCPR8Hbits_t CCPR8Hbits __at(0xF08);
// bitfield macros
#define _CCPR8H_CCPR8H_POSN                                 0x0
#define _CCPR8H_CCPR8H_POSITION                             0x0
#define _CCPR8H_CCPR8H_SIZE                                 0x8
#define _CCPR8H_CCPR8H_LENGTH                               0x8
#define _CCPR8H_CCPR8H_MASK                                 0xFF

// Register: CCP7CON
#define CCP7CON CCP7CON
extern volatile unsigned char           CCP7CON             __at(0xF09);
#ifndef _LIB_BUILD
asm("CCP7CON equ 0F09h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP7M                  :4;
        unsigned DC7B                   :2;
    };
    struct {
        unsigned CCP7M0                 :1;
        unsigned CCP7M1                 :1;
        unsigned CCP7M2                 :1;
        unsigned CCP7M3                 :1;
        unsigned DC7B0                  :1;
        unsigned DC7B1                  :1;
    };
} CCP7CONbits_t;
extern volatile CCP7CONbits_t CCP7CONbits __at(0xF09);
// bitfield macros
#define _CCP7CON_CCP7M_POSN                                 0x0
#define _CCP7CON_CCP7M_POSITION                             0x0
#define _CCP7CON_CCP7M_SIZE                                 0x4
#define _CCP7CON_CCP7M_LENGTH                               0x4
#define _CCP7CON_CCP7M_MASK                                 0xF
#define _CCP7CON_DC7B_POSN                                  0x4
#define _CCP7CON_DC7B_POSITION                              0x4
#define _CCP7CON_DC7B_SIZE                                  0x2
#define _CCP7CON_DC7B_LENGTH                                0x2
#define _CCP7CON_DC7B_MASK                                  0x30
#define _CCP7CON_CCP7M0_POSN                                0x0
#define _CCP7CON_CCP7M0_POSITION                            0x0
#define _CCP7CON_CCP7M0_SIZE                                0x1
#define _CCP7CON_CCP7M0_LENGTH                              0x1
#define _CCP7CON_CCP7M0_MASK                                0x1
#define _CCP7CON_CCP7M1_POSN                                0x1
#define _CCP7CON_CCP7M1_POSITION                            0x1
#define _CCP7CON_CCP7M1_SIZE                                0x1
#define _CCP7CON_CCP7M1_LENGTH                              0x1
#define _CCP7CON_CCP7M1_MASK                                0x2
#define _CCP7CON_CCP7M2_POSN                                0x2
#define _CCP7CON_CCP7M2_POSITION                            0x2
#define _CCP7CON_CCP7M2_SIZE                                0x1
#define _CCP7CON_CCP7M2_LENGTH                              0x1
#define _CCP7CON_CCP7M2_MASK                                0x4
#define _CCP7CON_CCP7M3_POSN                                0x3
#define _CCP7CON_CCP7M3_POSITION                            0x3
#define _CCP7CON_CCP7M3_SIZE                                0x1
#define _CCP7CON_CCP7M3_LENGTH                              0x1
#define _CCP7CON_CCP7M3_MASK                                0x8
#define _CCP7CON_DC7B0_POSN                                 0x4
#define _CCP7CON_DC7B0_POSITION                             0x4
#define _CCP7CON_DC7B0_SIZE                                 0x1
#define _CCP7CON_DC7B0_LENGTH                               0x1
#define _CCP7CON_DC7B0_MASK                                 0x10
#define _CCP7CON_DC7B1_POSN                                 0x5
#define _CCP7CON_DC7B1_POSITION                             0x5
#define _CCP7CON_DC7B1_SIZE                                 0x1
#define _CCP7CON_DC7B1_LENGTH                               0x1
#define _CCP7CON_DC7B1_MASK                                 0x20

