MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27J53/mcu.h
// Register: LATC
#define LATC LATC
extern volatile unsigned char           LATC                __at(0xF8B);
#ifndef _LIB_BUILD
asm("LATC equ 0F8Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATC0                  :1;
        unsigned LATC1                  :1;
        unsigned LATC2                  :1;
        unsigned                        :3;
        unsigned LATC6                  :1;
        unsigned LATC7                  :1;
    };
    struct {
        unsigned LC0                    :1;
        unsigned LC1                    :1;
        unsigned LC2                    :1;
        unsigned                        :3;
        unsigned LC6                    :1;
        unsigned LC7                    :1;
    };
} LATCbits_t;
extern volatile LATCbits_t LATCbits __at(0xF8B);
// bitfield macros
#define _LATC_LATC0_POSN                                    0x0
#define _LATC_LATC0_POSITION                                0x0
#define _LATC_LATC0_SIZE                                    0x1
#define _LATC_LATC0_LENGTH                                  0x1
#define _LATC_LATC0_MASK                                    0x1
#define _LATC_LATC1_POSN                                    0x1
#define _LATC_LATC1_POSITION                                0x1
#define _LATC_LATC1_SIZE                                    0x1
#define _LATC_LATC1_LENGTH                                  0x1
#define _LATC_LATC1_MASK                                    0x2
#define _LATC_LATC2_POSN                                    0x2
#define _LATC_LATC2_POSITION                                0x2
#define _LATC_LATC2_SIZE                                    0x1
#define _LATC_LATC2_LENGTH                                  0x1
#define _LATC_LATC2_MASK                                    0x4
#define _LATC_LATC6_POSN                                    0x6
#define _LATC_LATC6_POSITION                                0x6
#define _LATC_LATC6_SIZE                                    0x1
#define _LATC_LATC6_LENGTH                                  0x1
#define _LATC_LATC6_MASK                                    0x40
#define _LATC_LATC7_POSN                                    0x7
#define _LATC_LATC7_POSITION                                0x7
#define _LATC_LATC7_SIZE                                    0x1
#define _LATC_LATC7_LENGTH                                  0x1
#define _LATC_LATC7_MASK                                    0x80
#define _LATC_LC0_POSN                                      0x0
#define _LATC_LC0_POSITION                                  0x0
#define _LATC_LC0_SIZE                                      0x1
#define _LATC_LC0_LENGTH                                    0x1
#define _LATC_LC0_MASK                                      0x1
#define _LATC_LC1_POSN                                      0x1
#define _LATC_LC1_POSITION                                  0x1
#define _LATC_LC1_SIZE                                      0x1
#define _LATC_LC1_LENGTH                                    0x1
#define _LATC_LC1_MASK                                      0x2
#define _LATC_LC2_POSN                                      0x2
#define _LATC_LC2_POSITION                                  0x2
#define _LATC_LC2_SIZE                                      0x1
#define _LATC_LC2_LENGTH                                    0x1
#define _LATC_LC2_MASK                                      0x4
#define _LATC_LC6_POSN                                      0x6
#define _LATC_LC6_POSITION                                  0x6
#define _LATC_LC6_SIZE                                      0x1
#define _LATC_LC6_LENGTH                                    0x1
#define _LATC_LC6_MASK                                      0x40
#define _LATC_LC7_POSN                                      0x7
#define _LATC_LC7_POSITION                                  0x7
#define _LATC_LC7_SIZE                                      0x1
#define _LATC_LC7_LENGTH                                    0x1
#define _LATC_LC7_MASK                                      0x80

// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0xF8E);
#ifndef _LIB_BUILD
asm("PIE4 equ 0F8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3IE                 :1;
        unsigned CCP4IE                 :1;
        unsigned CCP5IE                 :1;
        unsigned CCP6IE                 :1;
        unsigned CCP7IE                 :1;
        unsigned CCP8IE                 :1;
        unsigned CCP9IE                 :1;
        unsigned CCP10IE                :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0xF8E);
// bitfield macros
#define _PIE4_CCP3IE_POSN                                   0x0
#define _PIE4_CCP3IE_POSITION                               0x0
#define _PIE4_CCP3IE_SIZE                                   0x1
#define _PIE4_CCP3IE_LENGTH                                 0x1
#define _PIE4_CCP3IE_MASK                                   0x1
#define _PIE4_CCP4IE_POSN                                   0x1
#define _PIE4_CCP4IE_POSITION                               0x1
#define _PIE4_CCP4IE_SIZE                                   0x1
#define _PIE4_CCP4IE_LENGTH                                 0x1
#define _PIE4_CCP4IE_MASK                                   0x2
#define _PIE4_CCP5IE_POSN                                   0x2
#define _PIE4_CCP5IE_POSITION                               0x2
#define _PIE4_CCP5IE_SIZE                                   0x1
#define _PIE4_CCP5IE_LENGTH                                 0x1
#define _PIE4_CCP5IE_MASK                                   0x4
#define _PIE4_CCP6IE_POSN                                   0x3
#define _PIE4_CCP6IE_POSITION                               0x3
#define _PIE4_CCP6IE_SIZE                                   0x1
#define _PIE4_CCP6IE_LENGTH                                 0x1
#define _PIE4_CCP6IE_MASK                                   0x8
#define _PIE4_CCP7IE_POSN                                   0x4
#define _PIE4_CCP7IE_POSITION                               0x4
#define _PIE4_CCP7IE_SIZE                                   0x1
#define _PIE4_CCP7IE_LENGTH                                 0x1
#define _PIE4_CCP7IE_MASK                                   0x10
#define _PIE4_CCP8IE_POSN                                   0x5
#define _PIE4_CCP8IE_POSITION                               0x5
#define _PIE4_CCP8IE_SIZE                                   0x1
#define _PIE4_CCP8IE_LENGTH                                 0x1
#define _PIE4_CCP8IE_MASK                                   0x20
#define _PIE4_CCP9IE_POSN                                   0x6
#define _PIE4_CCP9IE_POSITION                               0x6
#define _PIE4_CCP9IE_SIZE                                   0x1
#define _PIE4_CCP9IE_LENGTH                                 0x1
#define _PIE4_CCP9IE_MASK                                   0x40
#define _PIE4_CCP10IE_POSN                                  0x7
#define _PIE4_CCP10IE_POSITION                              0x7
#define _PIE4_CCP10IE_SIZE                                  0x1
#define _PIE4_CCP10IE_LENGTH                                0x1
#define _PIE4_CCP10IE_MASK                                  0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0xF8F);
#ifndef _LIB_BUILD
asm("PIR4 equ 0F8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3IF                 :1;
        unsigned CCP4IF                 :1;
        unsigned CCP5IF                 :1;
        unsigned CCP6IF                 :1;
        unsigned CCP7IF                 :1;
        unsigned CCP8IF                 :1;
        unsigned CCP9IF                 :1;
        unsigned CCP10IF                :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0xF8F);
// bitfield macros
#define _PIR4_CCP3IF_POSN                                   0x0
#define _PIR4_CCP3IF_POSITION                               0x0
#define _PIR4_CCP3IF_SIZE                                   0x1
#define _PIR4_CCP3IF_LENGTH                                 0x1
#define _PIR4_CCP3IF_MASK                                   0x1
#define _PIR4_CCP4IF_POSN                                   0x1
#define _PIR4_CCP4IF_POSITION                               0x1
#define _PIR4_CCP4IF_SIZE                                   0x1
#define _PIR4_CCP4IF_LENGTH                                 0x1
#define _PIR4_CCP4IF_MASK                                   0x2
#define _PIR4_CCP5IF_POSN                                   0x2
#define _PIR4_CCP5IF_POSITION                               0x2
#define _PIR4_CCP5IF_SIZE                                   0x1
#define _PIR4_CCP5IF_LENGTH                                 0x1
#define _PIR4_CCP5IF_MASK                                   0x4
#define _PIR4_CCP6IF_POSN                                   0x3
#define _PIR4_CCP6IF_POSITION                               0x3
#define _PIR4_CCP6IF_SIZE                                   0x1
#define _PIR4_CCP6IF_LENGTH                                 0x1
#define _PIR4_CCP6IF_MASK                                   0x8
#define _PIR4_CCP7IF_POSN                                   0x4
#define _PIR4_CCP7IF_POSITION                               0x4
#define _PIR4_CCP7IF_SIZE                                   0x1
#define _PIR4_CCP7IF_LENGTH                                 0x1
#define _PIR4_CCP7IF_MASK                                   0x10
#define _PIR4_CCP8IF_POSN                                   0x5
#define _PIR4_CCP8IF_POSITION                               0x5
#define _PIR4_CCP8IF_SIZE                                   0x1
#define _PIR4_CCP8IF_LENGTH                                 0x1
#define _PIR4_CCP8IF_MASK                                   0x20
#define _PIR4_CCP9IF_POSN                                   0x6
#define _PIR4_CCP9IF_POSITION                               0x6
#define _PIR4_CCP9IF_SIZE                                   0x1
#define _PIR4_CCP9IF_LENGTH                                 0x1
#define _PIR4_CCP9IF_MASK                                   0x40
#define _PIR4_CCP10IF_POSN                                  0x7
#define _PIR4_CCP10IF_POSITION                              0x7
#define _PIR4_CCP10IF_SIZE                                  0x1
#define _PIR4_CCP10IF_LENGTH                                0x1
#define _PIR4_CCP10IF_MASK                                  0x80

